* Isunnguata_13km-10
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Isunnguata_13km-10
Place name                       | Isunnguata Sermia
Geographic location              | Central West Greenland
Ice type                         | Ice sheet
Data Source                      | Meierbachtol email
Data DOI                         | 
Science Source                   | Harrington, Joel A., Humphrey, Neil F., Harper, Joel T.: Temperature distribution and thermal anomalies along a flowline of the Greenland ice sheet , Annals of Glaciology 56(70), 98–104, 2015 
Science DOI                      | 10.3189/2015AoG70A941
Date                             | 2010
Longitude [°E]                   | -50.02945
Latitude [°N]                    | 67.19158
Location Source                  | T. Meierbachtol email
Depth of top measurement [m]     | 4.0
Depth of bottom measurement [m]  | 559
Ice thickness [m]                | 704 MEIERBACHTOL?
Coverage [% of thickness]        | #VALUE!
Ice thickness source             | BedMachine v4
Note                             | See data in M1-10 folder; Harrington 2015 name: S2
#+end_example

** Temperature

** Thickness

** Location

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -g -k1
#+END_SRC

#+RESULTS: ingest_data
|     d |      t |
|   0.0 |    0.0 |
|  10.0 | -0.947 |
|  20.0 | -2.822 |
|  30.0 | -2.392 |
|  40.0 | -2.091 |
|  50.0 | -2.142 |
|  60.0 | -2.161 |
|  70.0 | -2.374 |
|  80.0 | -2.356 |
|  90.0 |  -2.52 |
| 100.0 | -2.647 |
| 110.0 | -2.699 |
| 120.0 | -2.773 |
| 130.0 | -2.901 |
| 140.0 |  -2.93 |
| 150.0 | -3.108 |
| 160.0 | -3.175 |
| 170.0 | -3.216 |
| 180.0 | -3.214 |
| 190.0 | -3.385 |
| 200.0 | -3.473 |
| 210.0 | -3.505 |
| 220.0 | -3.624 |
| 230.0 | -3.558 |
| 240.0 | -3.725 |
| 250.0 | -3.738 |
| 260.0 |  -3.82 |
| 270.0 | -3.878 |
| 280.0 | -3.728 |
| 290.0 | -3.923 |
| 300.0 |  -4.07 |
| 310.0 | -3.905 |
| 320.0 | -4.029 |
| 330.0 | -4.128 |
| 340.0 | -4.072 |
| 350.0 | -4.117 |
| 360.0 | -4.224 |
| 370.0 | -4.111 |
| 380.0 | -4.236 |
| 390.0 | -3.982 |
| 400.0 | -4.179 |
| 410.0 |  -3.94 |
| 420.0 | -4.029 |
| 430.0 | -4.005 |
| 440.0 | -4.093 |
| 450.0 | -3.984 |
| 460.0 |  -3.96 |
| 470.0 | -3.846 |
| 480.0 | -3.699 |
| 490.0 | -3.746 |
| 500.0 | -3.664 |
| 510.0 | -3.594 |
| 520.0 | -3.537 |
| 530.0 | -3.581 |
| 540.0 | -3.393 |
| 550.0 | -3.335 |
| 560.0 | -3.202 |

